# NewFamilyInstance Method (XYZ, FamilySymbol, Level, StructuralType) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ItemFactoryBase..::..NewFamilyInstance Method (XYZ, FamilySymbol, Level, StructuralType)
ItemFactoryBase Class See Also
---
Inserts a new instance of a family into the document, using a location, type/symbol, and the level.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilyInstance NewFamilyInstance(
	XYZ location,
	FamilySymbol symbol,
	Level level,
	StructuralType structuralType
)
```

Visual Basic
---
```text
Public Function NewFamilyInstance ( _
	location As XYZ, _
	symbol As FamilySymbol, _
	level As Level, _
	structuralType As StructuralType _
) As FamilyInstance
```

Visual C++
---
```text
public:
FamilyInstance^ NewFamilyInstance(
	XYZ^ location,
	FamilySymbol^ symbol,
	Level^ level,
	StructuralType structuralType
)
```

# ### Parameters
location
    Type: Autodesk.Revit.DB..::..XYZThe physical location where the instance is to be placed.
symbol
    Type: Autodesk.Revit.DB..::..FamilySymbolA FamilySymbol object that represents the type of the instance that is to be inserted.
level
    Type: Autodesk.Revit.DB..::..LevelThe level onto which the FamilyInstance is to be placed.
structuralType
    Type: Autodesk.Revit.DB.Structure..::..StructuralType If structural then specify the type of the component.
# ### Return Value
If creation was successful then an instance to the new object is returned, otherwise nullNothingnullptra null reference (Nothing in Visual Basic).
# Remarks
This method is used to place a family instance onto a level. If the instance fails to be created an exception may be thrown.
The type/symbol that is used must be loaded into the document before this method is called. Families and their symbols can be loaded using the Document.LoadFamily or Document.LoadFamilySymbol methods.
Some Families, such as Beams, have more than one endpoint and are inserted in the same manner as single point instances. Once inserted these linear family instances can have their endpoints changed by using the instance's Element.Location property.
Note: ForbiddenForDynamicUpdateException might be thrown during a dynamic update if the inserted instance establishes a mutual dependency with another structure.
Note: if the created family instance includes nested instances, the API framework will automatically regenerate the document during this method call.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the family symbol does not exist in the given document. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the level does not exist in the given document. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if The symbol is not active. |

# See Also
ItemFactoryBase Class
NewFamilyInstance Overload
Autodesk.Revit.Creation Namespace